package curriculum_B;

public class Question3 {

	public static void main(String[] args) {
		// TODO 自動生成されたメソッド・スタブ

		
		// =====================================
		// 問題１
		// =====================================
		
		// Int型変数が10になるまでループする処理
		for (int i = 1; i <= 10; i++) {
			
		// その結果を出力する
			   System.out.println(i);  
			  } 
		
		// =====================================
		// 問題２
		// =====================================
		
		// Int型変数が20になるまでループする処理
		for (int i = 1; i <=20; i++) {
		 
		// 変数が偶数のみ出力する	
			if (i % 2 == 0) {
			  System.out.println(i);
		     }
		}
		
		// =====================================
		// 問題３
		// =====================================
		
		// Int型変数に10を代入し変数が1になるまで減らす
		for (int i = 10; i >= 1; i--) {
			System.out.println("カウントダウン" + i);
		}
		
		// =====================================
		// 問題４
		// =====================================
		
		// 合計を入れる変数
		int sum  = 0;
		
		// 1から100まで繰り返す処理
		for (int i = 1; i <= 100; i++) {
		
		// 1から100までの合計を足す	
			sum += i;
		}
			
		// 結果を出力する
			System.out.println(sum);
		
		
		// =====================================
		// 問題５
		// =====================================
		
		// 行を繰り返す
		for (int i = 1; i <= 5; i++) {
		
		// 各行に出力する * の数を制御
		 for (int asterisk = 1; asterisk <= i; asterisk++) {
			 System.out.print("*");
			    }
		// 改行
			 System.out.println();
			 
			}

		// =====================================
		// 問題６
		// =====================================
		
		// 変数を宣言し値を代入
		int count = 1;
		
		// 変数が10になるまでループをする
		while (count <= 10) {
			
		// 結果を出力する
			System.out.println(count);
			count++; // countを1ずつ増やす
		
		// =====================================
		// 問題６
		// =====================================
		
		/*count = 1;
		
		while (count <= 20) {
			if (count % 2 == 0) {
				
			}
			
			System.out.println(count);
			count++;
		}
		*/
		
		
		}
		}

}
