package curriculum_B;

import java.util.Scanner;

public class Question3 {

	public static void main(String[] args) {
		// TODO 自動生成されたメソッド・スタブ

		
		// =====================================
		// 問題１
		// =====================================
		
		// Int型変数が10になるまでループする処理
		for (int i = 1; i <= 10; i++) {
			
		// その結果を出力する
			   System.out.println(i);  
			  } 
		
		// =====================================
		// 問題２
		// =====================================
		
		// Int型変数が20になるまでループする処理
		for (int i = 1; i <=20; i++) {
		 
		// 変数が偶数のみ出力する	
			if (i % 2 == 0) {
			  System.out.println(i);
		     }
		}
		
		// =====================================
		// 問題３
		// =====================================
		
		// Int型変数に10を代入し変数が1になるまで減らす
		for (int i = 10; i >= 1; i--) {
			  System.out.println("カウントダウン" + i);
		}
		
		// =====================================
		// 問題４
		// =====================================
		
		// 合計を入れる変数
		int sum  = 0;
		
		// 1から100まで繰り返す処理
		for (int i = 1; i <= 100; i++) {
		
		// 1から100までの合計を足す	
			sum += i;
		}
			
		// 結果を出力する
			  System.out.println(sum);
		
		
		// =====================================
		// 問題５
		// =====================================
		
		// 行を繰り返す
		for (int i = 1; i <= 5; i++) {
		
		// 各行に出力する * の数を制御
		 for (int asterisk = 1; asterisk <= i; asterisk++) {
			   System.out.print("*");
			    }
		// 改行
			   System.out.println();
			 
			}

		// =====================================
		// 問題６
		// =====================================
		
		// 変数を宣言し値を代入
		int count = 1;
		
		// 変数が10になるまでループをする
		while (count <= 10) {
		// 結果を出力する
			  System.out.println(count);
			count++; // ずつ増やす
		}
			
		// =====================================
		// 問題７
		// =====================================
		
		// 変数をし値を代入
		count = 1;
		
		// 1から20まで繰り返す
		while (count<= 20) {
			
		// 変数を2で割り切れる値のみ出力する
			if (count % 2 == 0) {
			  System.out.println(count);
			}
			count++; // 1ずつ増やす
		}

		// =====================================
		// 問題８
		// =====================================		
		
		// 変数を宣言し値を代入
		int i = 10;
		
		// 10から1まで繰り返す
		while (i >= 1) {
			  System.out.println("カウントダウン: " + i);
			i--; // 1ずつ減らす
			}
				
		// =====================================
		// 問題９
		// =====================================		
		
		// 合計を入れる変数
		sum = 0;
		
		// カウントする変数
		i = 1;
		
		// 1から100まで足し続ける
		while(i <= 100) {
			sum += i;
			i++;
		}
		
		// 結果を出力する
			System.out.println(sum);
		
		
		// =====================================
		// 問題１０
		// =====================================		
	
			
		// Scannerオブジェクトを作成し、入力を読み取れるように設定
		Scanner sc = new Scanner(System.in);
		
		// 変数を宣言し0以外の値を代入
		i = -1;
		
		// 0が入力されるまで繰り返す
		while(i != 0) {
			System.out.print("数値を入力してください：");
			i = sc.nextInt();
		}
			
		// 終了メッセージ
			System.out.println("終了しました");
			
		// スキャナーclose
			sc.close();
		
		
		// =====================================
		// 問題１１
		// =====================================		
	
		// 1～9 の九九を表示
			for (i = 1; i <= 9; i++) {

			    for (int o = 1; o <= 9; o++) {

		 // 数値を2桁表示（01など）
			String left  = String.format("%02d", i);
			String right = String.format("%02d", o);
			String result = String.format("%02d", i * o);

			        // 表示形式
			        System.out.print(left + " * " + right + " = " + result);

			        // 区切り表示
			        if (o != 9) {
			            System.out.print(" || ");
			        }
			    }

			    // 改行
			    System.out.println();
			}

	
	
	
	
	
	
		}

}
